app/Http/Controllers/Auth/LoginController.php

select * from `frontends` where `data_keys` = 'sign_in.content' limit 1
---
    public function showLoginForm()
    {

        $page_title = "Sign In";
        $content = Frontend::where('data_keys', 'sign_in.content')->first();

select * from `extensions` where `act` = 'custom-captcha' and `status` = 1 limit 1
---
    protected function validateLogin(Request $request)
    {
        $customRecaptcha = Extension::where('act', 'custom-captcha')->where('status', 1)->first();

select * from `user_logins` where `user_ip` = '2a01:598:d832:1147:c0f8:297:42ad:df8c' limit 1
---
    public function authenticated(Request $request, $user)
    {
        if ($user->status == 0) {
            $this->guard()->logout();
            return redirect()->route('user.login')->withErrors(['Your account has been deactivated.']);
        }


        $user = auth()->user();
        $user->tv = $user->ts == 1 ? 0 : 1;
        $user->save();
        $ip = $_SERVER["REMOTE_ADDR"];
        $exist = UserLogin::where('user_ip',$ip)->first();

insert into `user_logins` (`longitude`, `latitude`, `location`, `country_code`, `country`, `user_id`, `user_ip`, `browser`, `os`, `updated_at`, `created_at`) values ('7.0114', '51.4444', ' - - Germany - DE ', 'DE', 'Germany', 164, '2a01:598:d832:1147:c0f8:297:42ad:df8c', 'Handheld Browser', 'iPhone', '2023-05-04 14:20:17', '2023-05-04 14:20:17')
---

        $userLogin->browser = @$userAgent['browser'];
        $userLogin->os = @$userAgent['os_platform'];
        $userLogin->save();