app/Http/Controllers/Auth/RegisterController.php

    public function showRegistrationForm(Request $request)
    {
        $content = Frontend::where('data_keys', 'sign_up.content')->first();
---
select * from `frontends` where `data_keys` = 'sign_up.content' limit 1