app/Http/Helpers/helpers.php

function activeTemplate($asset = false)
{
    $gs = GeneralSetting::first(['active_template']);
---
select `active_template` from `general_settings` limit 1

function reCaptcha()
{
    $reCaptcha = Extension::where('act', 'google-recaptcha2')->where('status', 1)->first();
---
select * from `extensions` where `act` = 'google-recaptcha2' and `status` = 1 limit 1

function analytics()
{
    $analytics = Extension::where('act', 'google-analytics')->where('status', 1)->first();
---
select * from `extensions` where `act` = 'google-analytics' and `status` = 1 limit 1

function tawkto()
{
    $tawkto = Extension::where('act', 'tawk-chat')->where('status', 1)->first();
---
select * from `extensions` where `act` = 'tawk-chat' and `status` = 1 limit 1

function getCustomCaptcha($height = 46, $width = '300px', $bgcolor = '#003', $textcolor = '#abc')
{
    $textcolor = '#'.GeneralSetting::first()->base_color;
    $captcha = Extension::where('act', 'custom-captcha')->where('status', 1)->first();
---
select * from `general_settings` limit 1
select * from `extensions` where `act` = 'custom-captcha' and `status` = 1 limit 1

function captchaVerify($code, $secret)
{
    $captcha = Extension::where('act', 'custom-captcha')->where('status', 1)->first();
---
select * from `extensions` where `act` = 'custom-captcha' and `status` = 1 limit 1

function sendSms($user, $type, $shortCodes = [])
{
    $general = GeneralSetting::first(['sn', 'sms_api']);
    $sms_template = SmsTemplate::where('act', $type)->where('sms_status', 1)->first();
---
select `sn`, `sms_api` from `general_settings` limit 1
select * from `email_sms_templates` where `act` = 'DEPOSIT_COMPLETE' and `sms_status` = 1 limit 1

function sendEmail($user, $type = null, $shortCodes = [])
{
    $general = GeneralSetting::first();
---
select * from `general_settings` limit 1

function sendPhpMail($receiver_email, $receiver_name, $subject, $html)
{
    $gnl = GeneralSetting::first();
---
select * from `general_settings` limit 1

function getUserHigherPlan($user_id)
{
    return PurchasedPlan::where('user_id', $user_id)->where('is_expired', 0)->orderBy('plan_id', 'desc')->first();
---
select * from `purchased_plans` where `user_id` = 164 and `is_expired` = 0 order by `plan_id` asc limit 1

function updateWallet($user_id = '', $trx = '', $wallet_id = '', $commission_id = '', $opration = '', $amount = '', $details = '', $charges = '', $remarks = '', $plan_trx = ''){

    $user = User::findOrFail($user_id);

    $transaction = new Transaction();
    $transaction->user_id = $user_id;
    $transaction->amount = $amount;
    $transaction->charge = $charges;
    $transaction->details = $details;
    $transaction->trx =  $trx;
    $transaction->plan_trx =  $plan_trx;
    $transaction->country = User::where('id', $user_id)->first()->address->country;
    $transaction->remark = $remarks;
    $transaction->commission_id = $commission_id;

    $wallet = UserWallet::where(['user_id' => $user_id, 'wallet_id' => $wallet_id])->first();
---
select * from `users` where `id` = 191 limit 1
select * from `user_wallets` where (`user_id` = 191 and `wallet_id` = 1) limit 1

            $transaction2->post_balance = getAmount($passive_wallet->balance);
            $transaction2->trx_type = '+';
            $transaction2->wallet_id =  9;
            $transaction2->save();
---
insert into `transactions` (`user_id`, `amount`, `charge`, `details`, `trx`, `plan_trx`, `country`, `remark`, `commission_id`, `post_balance`, `trx_type`, `wallet_id`, `updated_at`, `created_at`) values (191, 50, 0, 'Deposit Via Tether USDT (TRC20)', 'CNBT3T2VOCAS', '', 'Indonesia', 'deposit_complete', '', 0, '+', 1, '2023-05-04 14:21:32', '2023-05-04 14:21:32')

        $transaction->trx_type = '+';
        $transaction->wallet_id =  $wallet_id;

        $wallet->save();
---
update `user_wallets` set `balance` = 50, `user_wallets`.`updated_at` = '2023-05-04 14:21:32' where `id` = 1331

function checkStatusNowPayments(){

    $deposits = Deposit::where('method_code', 507)->where('status', 0)->whereBetween('created_at', [Carbon::now()->startOfWeek(), Carbon::now()->endOfWeek()])->get();
---
select * from `deposits` where `method_code` = 507 and `status` = 0 and `created_at` between '2023-05-01 00:00:00' and '2023-05-07 23:59:59'

function getRankPoints($user_id){
    $user = User::find($user_id);
---
select * from `users` where `users`.`id` = 164 limit 1