app/Http/Controllers/Gateway/PaymentController.php

select * from `gateway_currencies` where exists (select * from `gateways` where `gateway_currencies`.`method_code` = `gateways`.`code` and `status` = 1) order by `method_code` asc
---
    public function deposit()
    {
        $gatewayCurrency = GatewayCurrency::whereHas('method', function ($gate) {
            $gate->where('status', 1);
        })->with('method')->orderby('method_code')->get();

select * from `general_settings` limit 1
select * from `deposits` where `trx` = 'CNBT3T2VOCAS' limit 1
update `deposits` set `status` = 1, `deposits`.`updated_at` = '2023-05-04 14:21:32' where `id` = 56
select * from `users` where `users`.`id` = 191 limit 1
insert into `admin_notifications` (`user_id`, `title`, `click_url`, `updated_at`, `created_at`) values (191, 'Deposit successful via Tether USDT (TRC20)', 'https://fairymetaverseco.io/admin/deposit/successful', '2023-05-04 14:21:32', '2023-05-04 14:21:32')
---
    public static function userDataUpdate($trx)
    {
        $gnl = GeneralSetting::first();
        $data = Deposit::where('trx', $trx)->first();
        if ($data->status == 0) {
            $data->status = 1;
            $data->save();

            $user = User::find($data->user_id);

            $notify[] = updateWallet($data->user_id, $data->trx, 1, NULL, '+', getAmount($data->amount), 'Deposit Via ' . $data->gateway_currency()->name, getAmount($data->charge), 'deposit_complete', NULL);

            $adminNotification = new AdminNotification();
            $adminNotification->user_id = $user->id;
            $adminNotification->title = 'Deposit successful via '.$data->gateway_currency()->name;
            $adminNotification->click_url = route('admin.deposit.successful');
            $adminNotification->save();