app/Http/Controllers/CronController.php

    public function cron($id)
    {
        //adjustLimit(10, 4);
        //updateCommissionWithLimit(3, 400, 2, 2, "Testing", 4, "A3SVMPMCNR5H");
        //flushWallets();
        //stormCommission(788);
        $gnl = GeneralSetting::first();
        $gnl->last_cron = Carbon::now()->toDateTimeString();
		$gnl->save();
        if($id == "5min"){
            // return 123;
            $crons = CronUpdate::where('status', 0)->get();
---
select * from `general_settings` limit 1
update `general_settings` set `last_cron` = '2023-05-04 14:21:31', `general_settings`.`updated_at` = '2023-05-04 14:21:31' where `id` = 1
select * from `cron_updates` where `status` = 0