app/Http/Controllers/UserController.php

    public function home()
    {
        $general = GeneralSetting::first();

        // if(Auth::user()->check_millionairemetaverse == NULL){
        //     $user = User::find(Auth::id());
        //     $updated_at = Carbon::now();
        //     $user->check_millionairemetaverse = $updated_at;
        //     $user->save();
        // }

        if(Auth::user()->check_car == NULL){
            $user = User::find(Auth::id());
            $updated_at = Carbon::now();
            $user->check_car = $updated_at;
            $user->save();
        }

        $data['page_title']         = "Dashboard";
        $data['db_name']            = Config::get('database.default');
        $data['totalDeposit']       = Deposit::where('user_id', auth()->id())->where('status', 1)->sum('amount');
        $data['totalWithdraw']      = Withdrawal::where('user_id', auth()->id())->where('status', 1)->sum('amount');
        $data['totalBvCut']         = getAmount(Auth::user()->total_bv);
        $data['user_extras']        = UserExtra::where('user_id', Auth::user()->id)->first();
        $data['plans']              = PurchasedPlan::where(["user_id" => Auth::user()->id])->orderBy('id', 'desc')->get();
        $data['wallets']            = UserWallet::where(["user_id" => Auth::user()->id])->where('status', 1)->get();
        $data['commissions']        = Commission::where('status', 1)->get();
        $data['rank']               = Rank::where(["id" => Auth::user()->rank_id])->first();
        $data['next_rank']          = Rank::where(["id" => Auth::user()->rank_id + 1])->first();
---
select * from `general_settings` limit 1
select sum(`amount`) as aggregate from `deposits` where `user_id` = 164 and `status` = 1
select sum(`amount`) as aggregate from `withdrawals` where `user_id` = 164 and `status` = 1
select * from `user_extras` where `user_id` = 164 limit 1
select * from `purchased_plans` where (`user_id` = 164) order by `id` desc
select * from `user_wallets` where (`user_id` = 164) and `status` = 1
select * from `commissions` where `status` = 1
select * from `ranks` where (`id` = 1) limit 1
select * from `ranks` where (`id` = 2) limit 1