app/Providers/AppServiceProvider.php

        });

        view()->composer('partials.seo', function ($view) {
            $seo = Frontend::where('data_keys', 'seo.data')->first();
---
select * from `frontends` where `data_keys` = 'seo.data' limit 1